doc: architecture diagram update
